Диплом/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Диплом/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Диплом/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы   

&НаКлиенте
Процедура ВКМ_ВидДоговораПриИзменении(Элемент)   
	
	ВКМ_ИзменениеРеквизитов();  
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 ВКМ_ИзменениеРеквизитов();
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ИзменениеРеквизитов()
		
	Если Не Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда 	
		
	Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Ложь;
	Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
			
Иначе
	
	Элементы.ВКМ_ДатаНачалаДоговора.Видимость = Истина;
	Элементы.ВКМ_ДатаОкончанияДоговора.Видимость = Истина;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина; 
				
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
